# Задача 32: 
# Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
#[-5,  9,  0,  3,  -1,  -2,  1,  4,  -2,  10,  2,  0,  -9,  8,  10,  -9,  0,  -5,  -5,  7]
#  0   1   2   3    4    5   6   7    8    9   10  11  12   13  14   15   16   17   18  19

list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print("Введите нижнюю границу диапазона:")
min1 = int(input())
print("Введите верхнюю границу диапазона:")
max1 = int(input())
k = len(list1)
list2 = []

for i in range(len(list1)):
    if min1 <= list1[i] <= max1:
        list2.append(i)
print(list2)